# Series

In [1]:
import pandas as pd
import numpy as np

In [3]:
myseries = pd.Series([10, 20, 30])

In [4]:
print(myseries)

0    10
1    20
2    30
dtype: int64

In [5]:
myseries.dtype

dtype('int64')

In [6]:
myseries = pd.Series(
    [10, 20, 30],
    index = ['a', 'b', 'c']
)

print(myseries)

a    10
b    20
c    30
dtype: int64

In [7]:
myseries = pd.Series(['Jane', 'John', 'Emily', 'Matt'])

print(myseries[0])

Jane

In [8]:
myseries = pd.Series([1, 2, 3])
print(myseries.is_unique)

True

In [9]:
myseries[1] = 3
print(myseries.is_unique)
print(myseries)

False
0    1
1    3
2    3
dtype: int64

# Dataframe

In [12]:
df = pd.DataFrame({'Name': ['Jane', 'John', 'Matt', 'Ashley'], 'Age': [24, 21, 26, 32]})
print(df)

     Name  Age
0    Jane   24
1    John   21
2    Matt   26
3  Ashley   32

In [13]:
print(df.shape)

(4, 2)

In [21]:
print(df.iloc[1])

Name    John
Age       21
Name: 1, dtype: object

# read_csv

In [26]:
sales = pd.read_csv('sales.csv')
print(sales.head())

   product_code product_group  stock_qty    cost    price  last_week_sales  \
0          4187           PG2        498  420.76   569.91               13
1          4195           PG2        473  545.64   712.41               16
2          4204           PG2        968  640.42   854.91               22
3          4219           PG2        241  869.69  1034.55               14
4          4718           PG2       1401   12.54    26.59               50

   last_month_sales
0                58
1                58
2                88
3                45
4               285

In [27]:
sales_test = pd.read_csv("sales.csv", usecols=["product_code","product_group","stock_qty"])

print(sales_test.head())

   product_code product_group  stock_qty
0          4187           PG2        498
1          4195           PG2        473
2          4204           PG2        968
3          4219           PG2        241
4          4718           PG2       1401

In [28]:
df = pd.DataFrame({
  "Names": ["Jane", "John", "Matt", "Ashley"],
  "Ages": [26, 24, 28, 25],
  "Score": [91.2, 94.1, 89.5, 92.3]
})

print(df)

    Names  Ages  Score
0    Jane    26   91.2
1    John    24   94.1
2    Matt    28   89.5
3  Ashley    25   92.3

In [35]:
arr = np.random.randint(1, 10, size=(3,5))
df = pd.DataFrame(arr, columns=['A', 'B', 'C', 'D', 'E'])
print(df)

   A  B  C  D  E
0  4  9  7  6  8
1  4  5  2  4  1
2  8  7  1  7  5

In [36]:
sales = pd.read_csv("sales.csv")

In [40]:
print(sales.shape)
print(sales.size)
print(len(sales))

(1000, 7)
7000
1000

In [41]:
print(sales.dtypes)

product_code          int64
product_group        object
stock_qty             int64
cost                float64
price               float64
last_week_sales       int64
last_month_sales      int64
dtype: object

In [42]:
print(sales.columns)

Index(['product_code', 'product_group', 'stock_qty', 'cost', 'price',
       'last_week_sales', 'last_month_sales'],
      dtype='object')

In [43]:
print(list(sales.columns))

['product_code', 'product_group', 'stock_qty', 'cost', 'price', 'last_week_sales', 'last_month_sales']

In [46]:
sales['stock_qty'] = sales['stock_qty'].astype('float')
print(sales.dtypes)

product_code          int64
product_group        object
stock_qty           float64
cost                float64
price               float64
last_week_sales       int64
last_month_sales      int64
dtype: object

In [47]:
sales = sales.astype({
  "stock_qty": "float",
  "last_week_sales": "float"
})

print(sales.dtypes)

product_code          int64
product_group        object
stock_qty           float64
cost                float64
price               float64
last_week_sales     float64
last_month_sales      int64
dtype: object

In [52]:
print(sales['product_group'].nunique())
print(sales['product_group'].unique())

6
['PG2' 'PG4' 'PG6' 'PG5' 'PG3' 'PG1']

In [53]:
print(sales['product_group'].value_counts())

product_group
PG4    349
PG5    255
PG6    243
PG2     75
PG3     39
PG1     39
Name: count, dtype: int64

In [54]:
myseries = pd.Series([1, 2, 5, 7, 11, 36])
print(myseries.median())

6.0

In [59]:
myseries = pd.Series([1, 4, 6, 6, 6, 11, 11, 24])
print(myseries.mode()[0])

6

In [58]:
print(sales.mode())

   product_code product_group  stock_qty   cost  price  last_week_sales  \
0        5694.0           PG4      313.0   3.85  10.44             13.0
1           NaN           NaN      749.0  12.93    NaN              NaN

   last_month_sales
0              48.0
1               NaN

In [63]:
sales = pd.read_csv('sales.csv')
print('Mean:')
print(sales['price'].mean())

print('Median:')
print(sales['price'].median())

print('Mode:')
print(sales['price'].mode()[0])

print('Min:')
print(sales['price'].min())

print('Max:')
print(sales['price'].max())

Mean:
67.06351000000001
Median:
23.74
Mode:
10.44
Min:
0.66
Max:
1500.05

In [67]:
print('Variance:')
print(sales['price'].var())

print('Standart deviation:')
print(sales['price'].std())

Variance:
20766.243824604506
Standart deviation:
144.10497501684148

In [68]:
print(sales['price'].sort_values(ascending=False))

528    1500.05
565    1325.16
710    1201.75
599    1177.05
3      1034.55
        ...
870       1.61
307       1.42
780       1.23
343       0.76
431       0.66
Name: price, Length: 1000, dtype: float64

# Фильтрация (loc[], iloc[])

In [1]:
import pandas as pd
import numpy as np

In [3]:
sales = pd.read_csv('sales.csv')

In [6]:
print(sales.loc[:4, ['product_code', 'product_group']])

   product_code product_group
0          4187           PG2
1          4195           PG2
2          4204           PG2
3          4219           PG2
4          4718           PG2

In [ ]:
print(sales.iloc[[5, 6, 7, 8], [0, 1]])

   product_code product_group
5          5630           PG4
6          5631           PG4
7          5634           PG4
8          2650           PG4

In [8]:
print(sales.iloc[5:9, :2])

   product_code product_group
5          5630           PG4
6          5631           PG4
7          5634           PG4
8          2650           PG4

In [9]:
df = pd.DataFrame(
    np.random.randint(10, size=(4,4)),
    index = ['a', 'b', 'c', 'd'],
    columns = ['col_a', 'col_b', 'col_c', 'col_d']
)

print(df)

   col_a  col_b  col_c  col_d
a      1      9      6      0
b      7      8      0      6
c      0      0      2      5
d      9      4      0      1

In [10]:
print(df.loc[['b', 'd'], ['col_a', 'col_c']])

   col_a  col_c
b      7      0
d      9      0

### Пример

In [11]:
# У вас есть DataFrame с данными о продажах товаров. Нужно выбрать третью и четвертую строки, а также первые два столбца.

# Пример ввода:

data = {
    'Product': ['Laptop', 'Smartphone', 'Tablet', 'Headphones'],
    'Price': [1000, 700, 300, 100],
    'Quantity': [5, 8, 3, 10]
}

df = pd.DataFrame(data)

                  
# Выход:

#      Product  Price
# 2     Tablet    300
# 3  Headphones    100

In [12]:
df

      Product  Price  Quantity
0      Laptop   1000         5
1  Smartphone    700         8
2      Tablet    300         3
3  Headphones    100        10

In [19]:
def solution(df):
    result = df.iloc[[2, 3], [0, 1]] # df.loc[[2:3], [0:1]]

    return result

In [20]:
print(solution(df))

      Product  Price
2      Tablet    300
3  Headphones    100

### Пример №2

In [31]:
# Используя метод loc, выберите первые 5 строк и столбцы с названиями product_code и product_group.

# Пример ввода:

df = pd.DataFrame({
    "product_code": ["A001", "A002", "A003", "A004", "A005", "A006"],
    "product_group": ["Group1", "Group2", "Group3", "Group4", "Group5", "Group6"],
    "price": [100, 200, 300, 400, 500, 600]
})

                  
# Выход:

#   product_code product_group
# 0         A001        Group1
# 1         A002        Group2
# 2         A003        Group3
# 3         A004        Group4
# 4         A005        Group5

In [38]:
def solution(df):
    result = df.loc[:4, ['product_code', 'product_group']]

    return result

In [39]:
print(solution(df))

  product_code product_group
0         A001        Group1
1         A002        Group2
2         A003        Group3
3         A004        Group4
4         A005        Group5

# Фильтрация по столбцам и условиям

In [41]:
sales = pd.read_csv("sales.csv")
selected_columns = ['product_code', 'price']
print(sales[selected_columns])

     product_code    price
0            4187   569.91
1            4195   712.41
2            4204   854.91
3            4219  1034.55
4            4718    26.59
..            ...      ...
995          8048    11.39
996          8050     3.32
997           952    61.74
998          1307    42.74
999          3018    18.99

[1000 rows x 2 columns]

In [44]:
print(sales[['product_code', 'price']])

     product_code    price
0            4187   569.91
1            4195   712.41
2            4204   854.91
3            4219  1034.55
4            4718    26.59
..            ...      ...
995          8048    11.39
996          8050     3.32
997           952    61.74
998          1307    42.74
999          3018    18.99

[1000 rows x 2 columns]

In [48]:
sales_filtered = sales[sales.product_group == 'PG2']
sales_filtered

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285
...,...,...,...,...,...,...,...
973,6341,PG2,1274,12.06,18.99,39,181
979,2218,PG2,3049,8.20,16.14,148,555
980,2219,PG2,3525,9.02,16.14,164,657
997,952,PG2,5388,37.71,61.74,331,1041
998,1307,PG2,44996,31.44,42.74,1772,6394

In [49]:
sales_filtered2 = sales[sales['product_group'] == 'PG2']
sales_filtered2

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285
...,...,...,...,...,...,...,...
973,6341,PG2,1274,12.06,18.99,39,181
979,2218,PG2,3049,8.20,16.14,148,555
980,2219,PG2,3525,9.02,16.14,164,657
997,952,PG2,5388,37.71,61.74,331,1041
998,1307,PG2,44996,31.44,42.74,1772,6394

In [50]:
sales_filtered.equals(sales_filtered2)

True

In [52]:
sales[sales['price'] > 100]

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
8,2650,PG4,239,59.40,111.06,15,38
...,...,...,...,...,...,...,...
865,3012,PG5,1079,140.13,189.91,39,205
867,5486,PG5,756,61.60,104.41,67,175
892,2971,PG1,234,124.69,180.41,20,47
929,1600,PG6,487,78.00,137.66,13,48
966,5630,PG4,545,99.83,161.49,16,52

In [53]:
sales_filtered = sales[(sales["price"] > 100) & (sales["stock_qty"] < 400)]

print(sales_filtered[["price","stock_qty"]].head())

       price  stock_qty
3    1034.55        241
8     111.06        239
165   208.91        244
186   427.41        369
199   104.49        144

In [55]:
sales_filtered = sales[(sales["product_group"] == "PG1") | (sales["product_group"] == "PG2")]
print(sales_filtered)

     product_code product_group  stock_qty    cost    price  last_week_sales  \
0            4187           PG2        498  420.76   569.91               13
1            4195           PG2        473  545.64   712.41               16
2            4204           PG2        968  640.42   854.91               22
3            4219           PG2        241  869.69  1034.55               14
4            4718           PG2       1401   12.54    26.59               50
..            ...           ...        ...     ...      ...              ...
975          4594           PG1        762   42.70    75.99               58
979          2218           PG2       3049    8.20    16.14              148
980          2219           PG2       3525    9.02    16.14              164
997           952           PG2       5388   37.71    61.74              331
998          1307           PG2      44996   31.44    42.74             1772

     last_month_sales
0                  58
1                  58
2                  88
3                  45
4                 285
..                ...
975               156
979               555
980               657
997              1041
998              6394

[114 rows x 7 columns]

In [56]:
print(sales[sales['product_group'].isin(['PG1', 'PG2', 'PG3'])])

     product_code product_group  stock_qty    cost    price  last_week_sales  \
0            4187           PG2        498  420.76   569.91               13
1            4195           PG2        473  545.64   712.41               16
2            4204           PG2        968  640.42   854.91               22
3            4219           PG2        241  869.69  1034.55               14
4            4718           PG2       1401   12.54    26.59               50
..            ...           ...        ...     ...      ...              ...
975          4594           PG1        762   42.70    75.99               58
979          2218           PG2       3049    8.20    16.14              148
980          2219           PG2       3525    9.02    16.14              164
997           952           PG2       5388   37.71    61.74              331
998          1307           PG2      44996   31.44    42.74             1772

     last_month_sales
0                  58
1                  58
2                  88
3                  45
4                 285
..                ...
975               156
979               555
980               657
997              1041
998              6394

[153 rows x 7 columns]

In [57]:
print(sales[~sales["product_group"].isin(["PG1", "PG2", "PG3"])])

     product_code product_group  stock_qty   cost   price  last_week_sales  \
5            5630           PG4        287   5.85    7.59               24
6            5631           PG4        262   9.56   10.44               35
7            5634           PG4        205  14.15   18.04               14
8            2650           PG4        239  59.40  111.06               15
9            5647           PG4        352   5.85   13.29               37
..            ...           ...        ...    ...     ...              ...
993          7950           PG4        435   8.73   16.14               17
994          8046           PG4        409  12.32   11.39               16
995          8048           PG4        415  11.99   11.39               28
996          8050           PG4        -10   1.32    3.32               14
999          3018           PG5       1697   4.68   18.99               19

     last_month_sales
5                 116
6                 130
7                  53
8                  38
9                 108
..                ...
993               112
994                22
995                60
996                11
999                52

[847 rows x 7 columns]

In [58]:
print(sales.query('price > 100'))

     product_code product_group  stock_qty    cost    price  last_week_sales  \
0            4187           PG2        498  420.76   569.91               13
1            4195           PG2        473  545.64   712.41               16
2            4204           PG2        968  640.42   854.91               22
3            4219           PG2        241  869.69  1034.55               14
8            2650           PG4        239   59.40   111.06               15
..            ...           ...        ...     ...      ...              ...
865          3012           PG5       1079  140.13   189.91               39
867          5486           PG5        756   61.60   104.41               67
892          2971           PG1        234  124.69   180.41               20
929          1600           PG6        487   78.00   137.66               13
966          5630           PG4        545   99.83   161.49               16

     last_month_sales
0                  58
1                  58
2                  88
3                  45
8                  38
..                ...
865               205
867               175
892                47
929                48
966                52

[140 rows x 7 columns]

In [59]:
sales_filtered = sales.query("price > 100 and stock_qty < 400")
sales_filtered

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
3,4219,PG2,241,869.69,1034.55,14,45
8,2650,PG4,239,59.40,111.06,15,38
165,1657,PG5,244,162.33,208.91,14,48
186,7269,PG5,369,388.49,427.41,13,49
199,3530,PG4,144,57.98,104.49,16,51
215,2093,PG5,189,656.19,740.91,12,44
368,7957,PG1,320,459.80,750.41,21,100
437,9820,PG5,169,56.10,109.16,13,26
443,2751,PG5,386,62.83,104.41,20,75
445,2756,PG5,323,62.83,104.41,23,56
478,2646,PG5,332,700.14,712.41,18,27
490,2533,PG5,274,94.05,151.91,31,93
503,7745,PG4,305,84.58,170.99,13,58
504,1925,PG4,64,621.50,949.91,12,31
512,8488,PG2,103,100.10,170.91,23,54
528,9692,PG1,68,1243.00,1500.05,26,94
529,9693,PG1,373,480.14,812.16,18,54
534,9168,PG5,266,113.88,170.91,13,35
551,5287,PG5,218,289.00,370.41,16,51
552,5703,PG5,152,549.41,569.91,23,39
554,9835,PG5,39,61.44,104.41,13,22
558,6300,PG4,313,176.00,227.91,23,85
578,7597,PG5,293,681.27,664.91,13,13
586,7848,PG4,173,94.60,170.91,12,34
599,1941,PG1,213,847.00,1177.05,18,72
600,1942,PG1,223,424.60,655.41,20,63
610,7154,PG5,313,55.00,104.41,31,91
634,2430,PG3,161,89.38,180.41,17,57
661,7729,PG5,332,80.19,118.66,14,34
671,6470,PG5,321,94.60,170.99,19,84
710,4140,PG1,92,803.00,1201.75,12,24
721,4148,PG1,255,405.10,612.66,18,39
722,4150,PG1,22,405.10,612.66,14,29
728,6958,PG5,387,355.61,308.66,33,131
731,6966,PG5,252,355.61,308.66,17,47
748,662,PG6,383,57.64,123.41,32,106
749,667,PG6,130,115.17,208.91,18,34
753,8893,PG4,355,137.50,189.91,13,43
788,9668,PG4,181,69.30,142.41,16,44
826,8692,PG2,176,261.07,446.41,18,86
827,8693,PG2,157,197.63,360.91,19,94
828,8695,PG2,172,197.63,379.91,28,54
829,8696,PG2,132,296.43,484.41,14,60
830,8697,PG2,116,391.61,569.91,12,78
842,3846,PG4,100,114.92,194.66,12,22
892,2971,PG1,234,124.69,180.41,20,47

In [63]:
print(sales_filtered[["product_code","price","stock_qty"]].head())

     product_code    price  stock_qty
3            4219  1034.55        241
8            2650   111.06        239
165          1657   208.91        244
186          7269   427.41        369
199          3530   104.49        144

In [67]:
sales_filtered = sales.query("product_group == 'PG2'")
print(sales_filtered[sales_filtered['product_group'] != 'PG2'])

Empty DataFrame
Columns: [product_code, product_group, stock_qty, cost, price, last_week_sales, last_month_sales]
Index: []

### Пример

In [ ]:
# Отфильтруйте товары из DataFrame sales, у которых цена больше 200 и количество на складе меньше 100.

# Вход:

sales = pd.DataFrame({
    'product_code': ['P001', 'P002', 'P003', 'P004'],
    'product_group': ['PG1', 'PG3', 'PG2', 'PG3'],
    'price': [150, 250, 50, 400],
    'stock_qty': [300, 80, 150, 40]
})

                  
# Выход:

#   product_code product_group  price  stock_qty
# 1         P002           PG3    250         80
# 3         P004           PG3    400         40

In [71]:
def solution(df):
    result = df[(df['price'] > 200) & (df['stock_qty'] < 100)]

    return result

In [72]:
solution(sales)

  product_code product_group  price  stock_qty
1         P002           PG3    250         80
3         P004           PG3    400         40

### Пример 2

In [76]:
# В DataFrame содержится информация о продажах товаров. Отфильтруйте товары, принадлежащие к товарной группе "PG1" или "PG4", и у которых цена меньше 50 долларов.

# Инпут:

sales = pd.DataFrame({
    "product_code": [101, 102, 103, 104],
    "product_group": ["PG1", "PG2", "PG1", "PG4"],
    "price": [40, 60, 30, 45]
})

                  
# Аутпут:

# pd.DataFrame({
#     "product_code": [101, 103, 104],
#     "product_group": ["PG1", "PG1", "PG4"],
#     "price": [40, 30, 45]
# })

In [84]:
def solution(df):
    result = df[(df['product_group'].isin(['PG1', 'PG4'])) & (df['price'] < 50)]

    return result

In [85]:
solution(sales)

   product_code product_group  price
0           101           PG1     40
2           103           PG1     30
3           104           PG4     45

## Проверочная

### 1 задание

In [86]:
# Выберите товары, у которых цена больше 200 и количество на складе меньше 150.

# Вход:


data = {
    'product_name': ['Laptop', 'Smartphone', 'Tablet', 'Headphones'],
    'price': [1000, 700, 150, 80],
    'stock_qty': [50, 120, 300, 400]
}

df = pd.DataFrame(data)

                  
# Выход:

#   product_name  price  stock_qty
# 0       Laptop   1000         50
# 1   Smartphone    700        120

In [88]:
df

  product_name  price  stock_qty
0       Laptop   1000         50
1   Smartphone    700        120
2       Tablet    150        300
3   Headphones     80        400

In [89]:
def solution(df):
    result = df[(df['price'] > 200) & (df['stock_qty'] < 150)]

    return result

In [90]:
print(solution(df))

  product_name  price  stock_qty
0       Laptop   1000         50
1   Smartphone    700        120

### 2 задание

In [92]:
# Отфильтруйте товары, которые принадлежат к категориям "Electronics" или "Furniture" и имеют цену меньше 500. Затем выведите столбцы "product_name", "price", и "stock_qty".

# Вход:

data = {
    'product_name': ['Laptop', 'Smartphone', 'Tablet', 'Sofa', 'Chair'],
    'product_group': ['Electronics', 'Electronics', 'Electronics', 'Furniture', 'Furniture'],
    'price': [1000, 700, 300, 400, 150],
    'stock_qty': [50, 120, 300, 10, 50]
}

df = pd.DataFrame(data)

                  
# Вывод:

#   product_name  price  stock_qty
# 2       Tablet    300        300
# 3         Sofa    400         10
# 4        Chair    150         50

In [99]:
def solution(df):
    result = df[(df['product_group'].isin(['Electronics', 'Furniture'])) & (df['price'] < 500)]

    return result[['product_name', 'price', 'stock_qty']]

In [100]:
display(solution(df))

  product_name  price  stock_qty
2       Tablet    300        300
3         Sofa    400         10
4        Chair    150         50

### 3 задание

In [101]:
# Дан DataFrame с информацией о книгах. Отфильтруйте все книги, написанные автором "J.K. Rowling", и выведите название книги и количество проданных копий.

# Вход:

data = {
    'title': ['Harry Potter', 'The Hobbit', 'Fantastic Beasts', 'Silmarillion'],
    'author': ['J.K. Rowling', 'J.R.R. Tolkien', 'J.K. Rowling', 'J.R.R. Tolkien'],
    'sold_copies': [5000000, 3000000, 2000000, 1000000]
}

                  
# Выход:

#            title  sold_copies
# 0   Harry Potter      5000000
# 2  Fantastic Beasts    2000000

In [102]:
df = pd.DataFrame(data)

In [103]:
import pandas as pd

def solution(df):
    result = df[df['author'] == 'J.K. Rowling']

    return result[['title', 'sold_copies']]

In [104]:
display(solution(df))

              title  sold_copies
0      Harry Potter      5000000
2  Fantastic Beasts      2000000

# Работа с типами данных и пропущенными значениями

In [3]:
import pandas as pd
import numpy as np

In [49]:
staff = pd.read_csv('staff.csv')
staff

,name,city,date_of_birth,start_date,salary,department
0,John Doe,"Houston, TX",1998-11-04,2018-08-11,"$65,000",Accounting
1,Jane Doe,"San Jose, CA",1995-08-05,2017-08-24,"$70,000",Field Quality
2,Matt smith,"Dallas, TX",1996-11-25,2020-04-16,"$58,500",human resources
3,Ashley Harris,"Miami, FL",1995-01-08,2021-02-11,"$49,500",accounting
4,Jonathan targett,"Santa Clara, CA",1998-08-14,2020-09-01,"$62,000",field quality
5,Hale Cole,"Atlanta, GA",2000-10-24,2021-10-20,"$54,500",engineering

In [4]:
print(f"\nStaff data frame has the following columns: \n{list(staff.columns)}\n")

Staff data frame has the following columns:
['name', 'city', 'date_of_birth', 'start_date', 'salary', 'department']

In [12]:
print(staff['name'].str[0])

0    J
1    J
2    M
3    A
4    J
5    H
Name: name, dtype: object

In [14]:
print(staff['name'].str[:3])

0    Joh
1    Jan
2    Mat
3    Ash
4    Jon
5    Hal
Name: name, dtype: object

In [15]:
print(staff["name"].str[-2:])

0    oe
1    oe
2    th
3    is
4    tt
5    le
Name: name, dtype: object

In [16]:
print(staff["name"].str[1::2])

0        onDe
1        aeDe
2       atsih
3      slyHri
4    oahntret
5        aeCl
Name: name, dtype: object

In [17]:
print(staff['name'].str.split(' '))

0            [John, Doe]
1            [Jane, Doe]
2          [Matt, smith]
3       [Ashley, Harris]
4    [Jonathan, targett]
5           [Hale, Cole]
Name: name, dtype: object

In [18]:
print(staff['name'].str.split(' ', expand=True))

          0        1
0      John      Doe
1      Jane      Doe
2      Matt    smith
3    Ashley   Harris
4  Jonathan  targett
5      Hale     Cole

In [25]:
staff['last_name'] = staff['name'].str.split(' ', expand=True)[1]
print(staff[['name', 'last_name']])

               name last_name
0          John Doe       Doe
1          Jane Doe       Doe
2        Matt smith     smith
3     Ashley Harris    Harris
4  Jonathan targett   targett
5         Hale Cole      Cole

In [ ]:
# print(staff['name'] + ' - ' + staff['department'])

0               John Doe - Accounting
1            Jane Doe - Field Quality
2        Matt smith - human resources
3          Ashley Harris - accounting
4    Jonathan targett - field quality
5             Hale Cole - engineering
dtype: object

In [3]:
staff['name_lower'] = staff['name'].str.lower()
print(staff[['name', 'name_lower']])

               name        name_lower
0          John Doe          john doe
1          Jane Doe          jane doe
2        Matt smith        matt smith
3     Ashley Harris     ashley harris
4  Jonathan targett  jonathan targett
5         Hale Cole         hale cole

In [4]:
print(staff['department'].str.capitalize())

0         Accounting
1      Field quality
2    Human resources
3         Accounting
4      Field quality
5        Engineering
Name: department, dtype: object

In [7]:
staff["state"] = staff["city"].str[-2:]

staff["state"].replace(
    {"TX": "Texas", "CA": "California", "FL": "Florida", "GA": "Georgia"},
    inplace = True
)

print(staff["state"])

0         Texas
1    California
2         Texas
3       Florida
4    California
5       Georgia
Name: state, dtype: object

In [8]:
print(staff["city"].str.split(",", expand=True)[1].str.lower())

0     tx
1     ca
2     tx
3     fl
4     ca
5     ga
Name: 1, dtype: object

In [9]:
print(staff["department"], staff["department"].str.lower().replace("field quality","quality"))

0         Accounting
1      Field Quality
2    human resources
3         accounting
4      field quality
5        engineering
Name: department, dtype: object 0         accounting
1            quality
2    human resources
3         accounting
4            quality
5        engineering
Name: department, dtype: object

### 1 задание

In [7]:
# Объедините столбцы "Имя" и "Отдел" в одну строку с разделителем "-". Выведите новый объединённый столбец.

# Вход:

data = {'name': ['Alice Smith', 'Bob Johnson'], 'department': ['HR', 'Sales']}
df = pd.DataFrame(data)

                  
# Выход:

# 0    Alice Smith-HR
# 1    Bob Johnson-Sales

In [8]:
import pandas as pd

def solution(df):
    result = df['name'] + '-' + df['department']

    return result

In [9]:
print(solution(df))

0       Alice Smith-HR
1    Bob Johnson-Sales
dtype: object

### 2 задание

In [10]:
# Разделите столбец "Имя" на два новых столбца: "Имя" и "Фамилия" (Гарантированно разделенные пробелом). Затем выведите получившиеся столбцы.

# Вход:

data = {'name': ['Alice Smith', 'Bob Johnson', 'Charlie Brown']}
df=pd.DataFrame(data)

                  
# Выход:

#     first_name last_name
# 0        Alice      Smith
# 1          Bob    Johnson
# 2      Charlie      Brown

In [11]:
def solution(df):
    result = pd.DataFrame(columns=['first_name', 'last_name'])
    result[['first_name', 'last_name']] = df['name'].str.split(' ', expand=True)

    return result

In [12]:
print(solution(df))

  first_name last_name
0      Alice     Smith
1        Bob   Johnson
2    Charlie     Brown

### 3 задание

In [13]:
# Дан DataFrame с информацией о сотрудниках, включая их имена и даты найма в формате "дд/мм/гггг". Вам нужно:

# Извлечь только год из столбца "hire_date".
# Разделить столбец "name" на два новых столбца: "first_name" и "last_name".
# Объединить фамилию и год найма в один столбец с разделителем " - ".
# Преобразовать фамилию в верхний регистр в новом столбце.
# Вход:

data = {
    'name': ['Alice Smith', 'Bob Johnson', 'Charlie Brown'],
    'hire_date': ['15/03/2010', '22/07/2015', '01/01/2020']
}
df=pd.DataFrame(data)

                  
# Выход:

# first_name  last_name  year_hired          combined
# 0      Alice      Smith        2010         SMITH - 2010
# 1        Bob    Johnson        2015       JOHNSON - 2015
# 2    Charlie      Brown        2020         BROWN - 2020

                  
# Sample Input:

# Sample Output:

# True

In [42]:
def solution(df):
    result = pd.DataFrame(columns=['first_name', 'last_name', 'year_hired', 'combined'])
    result[['first_name', 'last_name']] = df['name'].str.split(' ', expand=True)
    result['year_hired'] = df['hire_date'].str[6:]
    result['combined'] = result['last_name'].str.upper() + ' - ' + result['year_hired']
    return result

In [43]:
display(solution(df))

  first_name last_name year_hired        combined
0      Alice     Smith       2010    SMITH - 2010
1        Bob   Johnson       2015  JOHNSON - 2015
2    Charlie     Brown       2020    BROWN - 2020

# Дата и время

In [2]:
mydate = pd.to_datetime("2021-11-10")

display(mydate)

Timestamp('2021-11-10 00:00:00')

In [3]:
first_date = pd.to_datetime("2021-10-10")
second_date = pd.to_datetime("2021-10-02")

diff = first_date - second_date

print(diff)

8 days 00:00:00

In [2]:
staff = pd.read_csv('staff.csv')

staff = staff.astype({
    "date_of_birth": "datetime64[ns]",
    "start_date": "datetime64[ns]",
})

print(staff.dtypes)

name                     object
city                     object
date_of_birth    datetime64[ns]
start_date       datetime64[ns]
salary                   object
department               object
dtype: object

In [5]:
staff

,name,city,date_of_birth,start_date,salary,department
0,John Doe,"Houston, TX",1998-11-04,2018-08-11,"$65,000",Accounting
1,Jane Doe,"San Jose, CA",1995-08-05,2017-08-24,"$70,000",Field Quality
2,Matt smith,"Dallas, TX",1996-11-25,2020-04-16,"$58,500",human resources
3,Ashley Harris,"Miami, FL",1995-01-08,2021-02-11,"$49,500",accounting
4,Jonathan targett,"Santa Clara, CA",1998-08-14,2020-09-01,"$62,000",field quality
5,Hale Cole,"Atlanta, GA",2000-10-24,2021-10-20,"$54,500",engineering

In [6]:
mydate = pd.to_datetime("2021-10-10")

print(f"The year part is {mydate.year}")
print(f"The month part is {mydate.month}")
print(f"The week number part is {mydate.week}")
print(f"The day part is {mydate.day}")

The year part is 2021
The month part is 10
The week number part is 40
The day part is 10

In [7]:
mydate.day_of_week

6

In [8]:
mydate = pd.to_datetime("2021-10-10 14:30:00")

print(f"The hour part of mydate is {mydate.hour}")
print(f"The minute part of mydate is {mydate.minute}")
print(f"The second part of mydate is {mydate.second}")

The hour part of mydate is 14
The minute part of mydate is 30
The second part of mydate is 0

In [9]:
mydate.day_of_year

283

In [10]:
dir(mydate)

['__add__',
 '__array_priority__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__pyx_vtable__',
 '__radd__',
 '__reduce__',
 '__reduce_cython__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__setstate__',
 '__setstate_cython__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__weakref__',
 '_creso',
 '_date_repr',
 '_from_dt64',
 '_from_value_and_reso',
 '_repr_base',
 '_round',
 '_time_repr',
 '_value',
 'as_unit',
 'asm8',
 'astimezone',
 'ceil',
 'combine',
 'ctime',
 'date',
 'day',
 'day_name',
 'day_of_week',
 'day_of_year',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'dst',
 'floor',
 'fold',
 'fromisocalendar',
 'fromisoformat',
 'fromordinal',
 'fromtimestamp',
 'hour',
 'is_leap_year',
 'is_month_end',
 'is_month_start',
 'is_quarter_end',
 'is_quarter_start',
 'is_year_end',
 'is_year_start',
 'isocalendar',
 'isoformat',
 'isoweekday',
 'max',
 'microsecond',
 'min',
 'minute',
 'month',
 'month_name',
 'nanosecond',
 'normalize',
 'now',
 'quarter',
 'replace',
 'resolution',
 'round',
 'second',
 'strftime',
 'strptime',
 'time',
 'timestamp',
 'timetuple',
 'timetz',
 'to_datetime64',
 'to_julian_date',
 'to_numpy',
 'to_period',
 'to_pydatetime',
 'today',
 'toordinal',
 'tz',
 'tz_convert',
 'tz_localize',
 'tzinfo',
 'tzname',
 'unit',
 'utcfromtimestamp',
 'utcnow',
 'utcoffset',
 'utctimetuple',
 'value',
 'week',
 'weekday',
 'weekofyear',
 'year']

In [11]:
vars(mydate)

{}

In [12]:
mydate = pd.to_datetime("2021-12-21 00:00:00")

print(f"The date part is {mydate.date()}")
print(f"The day part is {mydate.weekday()}")
print(f"The name of the month is {mydate.month_name()}")
print(f"The name of the day is {mydate.day_name()}")

The date part is 2021-12-21
The day part is 1
The name of the month is December
The name of the day is Tuesday

In [13]:
staff["start_date"]

0   2018-08-11
1   2017-08-24
2   2020-04-16
3   2021-02-11
4   2020-09-01
5   2021-10-20
Name: start_date, dtype: datetime64[ns]

In [ ]:
staff["start_month"] = staff["start_date"].dt.month # type: ignore

In [15]:
print(staff[["start_date", "start_month"]])

  start_date  start_month
0 2018-08-11            8
1 2017-08-24            8
2 2020-04-16            4
3 2021-02-11            2
4 2020-09-01            9
5 2021-10-20           10

In [ ]:
staff["start_date"].dt.isocalendar() # type: ignore

   year  week  day
0  2018    32    6
1  2017    34    4
2  2020    16    4
3  2021     6    4
4  2020    36    2
5  2021    42    3

In [ ]:
staff["raise_date"] = staff["start_date"] + pd.DateOffset(years=1)

display(staff[["start_date", "raise_date"]])

  start_date raise_date
0 2018-08-11 2019-08-11
1 2017-08-24 2018-08-24
2 2020-04-16 2021-04-16
3 2021-02-11 2022-02-11
4 2020-09-01 2021-09-01
5 2021-10-20 2022-10-20

In [25]:
staff["start_date"] + pd.DateOffset(months=6)

0   2019-02-11
1   2018-02-24
2   2020-10-16
3   2021-08-11
4   2021-03-01
5   2022-04-20
Name: start_date, dtype: datetime64[ns]

In [26]:
display(staff["start_date"] + pd.Timedelta(value=12, unit="W"))

0   2018-11-03
1   2017-11-16
2   2020-07-09
3   2021-05-06
4   2020-11-24
5   2022-01-12
Name: start_date, dtype: datetime64[ns]

In [27]:
display(staff["start_date"] + pd.Timedelta("12 W"))

0   2018-11-03
1   2017-11-16
2   2020-07-09
3   2021-05-06
4   2020-11-24
5   2022-01-12
Name: start_date, dtype: datetime64[ns]

## Задача

In [37]:
# Кол время работы за день

data = {
    'employee': ['John'],
    'start_time': ['2023-09-10 08:00:00'],
    'end_time': ['2023-09-10 17:00:00']
}
df=pd.DataFrame(data)

In [83]:
def solution(df):
    df['end_time'] = pd.to_datetime(df['end_time'])
    df['start_time'] = pd.to_datetime(df['start_time'])
    df['work_duration'] = pd.to_datetime(df['end_time']) - pd.to_datetime(df['start_time'])

    return df

In [84]:
print(solution(df))

  employee          start_time            end_time   work_duration
0     John 2023-09-10 08:00:00 2023-09-10 17:00:00 0 days 09:00:00

# Пропущенные значения

In [4]:
staff = pd.read_csv('staff.csv')

In [7]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan],
    "B": [2.4, 6.2, 5.1, np.nan],
    "C": ["foo","zoo","bar", np.nan]
})

display(df)
print(df)

     A    B    C
0  1.0  2.4  foo
1  2.0  6.2  zoo
2  3.0  5.1  bar
3  NaN  NaN  NaN

     A    B    C
0  1.0  2.4  foo
1  2.0  6.2  zoo
2  3.0  5.1  bar
3  NaN  NaN  NaN

In [8]:
df["A"] = df["A"].astype(pd.Int64Dtype())

display(df)

      A    B    C
0     1  2.4  foo
1     2  6.2  zoo
2     3  5.1  bar
3  <NA>  NaN  NaN

In [11]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7]
})

display(df)
display(df.isna())

     A    B    C     D
0  1.0  2.4  NaN  11.5
1  2.0  NaN  foo   NaN
2  3.0  5.1  zoo   6.2
3  NaN  NaN  bar  21.1
4  7.0  2.6  NaN   8.7

       A      B      C      D
0  False  False   True  False
1  False   True  False   True
2  False  False  False  False
3   True   True  False  False
4  False  False   True  False

In [17]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7]
})

display(df.isna().sum())
display(df.isna().sum().sum())
display(df.isna().sum(axis=1))

A    1
B    2
C    2
D    1
dtype: int64

np.int64(6)

0    1
1    2
2    0
3    2
4    1
dtype: int64

In [20]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7],
    "E": [1, 2, 3, 4, 5]
})

display(df.dropna(axis=0, how='any'))
display(df.dropna(axis=1, how='any'))

     A    B    C    D  E
2  3.0  5.1  zoo  6.2  3

   E
0  1
1  2
2  3
3  4
4  5

In [21]:
display(df.dropna(thresh=4))

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
2  3.0  5.1  zoo   6.2  3
4  7.0  2.6  NaN   8.7  5

In [22]:
df.dropna(thresh=4, inplace=True)

display(df)

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
2  3.0  5.1  zoo   6.2  3
4  7.0  2.6  NaN   8.7  5

In [25]:
# Замена NaN
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7],
    "E": [1, 2, 3, 4, 5]
})

display(df['A'].fillna(value=df['A'].mean()))

0    1.00
1    2.00
2    3.00
3    3.25
4    7.00
Name: A, dtype: float64

In [26]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7],
    "E": [1, 2, 3, 4, 5]
})

print(df.fillna({"A": df['A'].mean(), "D": df['D'].mean()}))

      A    B    C       D  E
0  1.00  2.4  NaN  11.500  1
1  2.00  NaN  foo  11.875  2
2  3.00  5.1  zoo   6.200  3
3  3.25  NaN  bar  21.100  4
4  7.00  2.6  NaN   8.700  5

In [31]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7],
    "E": [1, 2, 3, 4, 5]
})

print("Filling backward")
print(df["A"].bfill())

print("\nFilling forward")
print(df["A"].ffill())

Filling backward
0    1.0
1    2.0
2    3.0
3    7.0
4    7.0
Name: A, dtype: float64

Filling forward
0    1.0
1    2.0
2    3.0
3    3.0
4    7.0
Name: A, dtype: float64

In [33]:
df = pd.DataFrame({
    "A": [1, 2, np.nan, np.nan, 8]
})

print("Without the limit parameter")
print(df.bfill())

print("\nWith the limit parameter")
print(df.bfill(limit=1))

Without the limit parameter
     A
0  1.0
1  2.0
2  8.0
3  8.0
4  8.0

With the limit parameter
     A
0  1.0
1  2.0
2  NaN
3  8.0
4  8.0

## Задача

In [34]:
data = {
    'name': ['Anna', 'Mike', 'Sophia'],
    'age': [29, None, 34]
}
df=pd.DataFrame(data)

In [55]:
def solution(df):
    result = pd.concat([df['name'], df['age'].fillna(value=df['age'].mean())], axis=1)

    return result

In [56]:
display(solution(df))

     name   age
0    Anna  29.0
1    Mike  31.5
2  Sophia  34.0

## Задача 2

In [98]:
df = pd.DataFrame({
    "A": [1, 2, np.nan, 5],
    "B": [np.nan, 5, 6, 7],
    "C": ["foo", np.nan, "foo", "bar"]
})

df

     A    B    C
0  1.0  NaN  foo
1  2.0  5.0  NaN
2  NaN  6.0  foo
3  5.0  7.0  bar

In [99]:
def solution(df):
    
    for col in df.columns:
        if pd.api.types.is_numeric_dtype(df[col]):
            df[col] = df[col].fillna(df[col].mean())
        else:
            df[col] = df[col].fillna(df[col].mode()[0])

    return df

In [100]:
display(solution(df))

          A    B    C
0  1.000000  6.0  foo
1  2.000000  5.0  foo
2  2.666667  6.0  foo
3  5.000000  7.0  bar